function obj = createSignal(obj)
%CREATESIGNAL Создавалка сигнала по дано

    U1 = obj.U1;
    U2 = obj.U2;
    U3 = obj.U3;
    U4 = obj.U4;
    T = obj.T;
    n = obj.n;
    m = obj.m;
    f_gr = obj.f_gr;
    T2 = obj.T2;

    % Создание функций для различных T1
    syms t % Крутая штука, мб чудотворна
    u_1 = piecewise( ...
        t < 0, 0, ...                          % от -∞ до 0: значение 0
        t == 0, U1, ...                         % в точке 0: значение u1
        t > 0 & t < T(1), U1 + (U2 - U1)*(t/T(1)), ... % от 0 до t1: линейно от u1 до u2
        t == T(1), U3, ...                         % в точке t1: значение u3 (скачок)
        t > T(1) & t < T2, U3 + (U4 - U3)*((t - T(1))/(T2 - T(1))), ... % от t1 до t2: линейно от u3 до u4
        t == T2, U4, ...                          % в точке T2: значение u4
        t > T2, 0 ...                          % от T2 до ∞: значение 0
    );

    u_2 = piecewise( ...
        t < 0, 0, ...                          % от -∞ до 0: значение 0
        t == 0, U1, ...                         % в точке 0: значение u1
        t > 0 & t < T(2), U1 + (U2 - U1)*(t/T(2)), ... % от 0 до t1: линейно от u1 до u2
        t == T(1), U3, ...                         % в точке t1: значение u3 (скачок)
        t > T(2) & t < T2, U3 + (U4 - U3)*((t - T(2))/(T2 - T(2))), ... % от t1 до t2: линейно от u3 до u4
        t == T2, U4, ...                          % в точке T2: значение u4
        t > T2, 0 ...                          % от T2 до ∞: значение 0
    );

    u_3 = piecewise( ...
        t < 0, 0, ...                          % от -∞ до 0: значение 0
        t == 0, U1, ...                         % в точке 0: значение u1
        t > 0 & t < T(3), U1 + (U2 - U1)*(t/T(3)), ... % от 0 до t1: линейно от u1 до u2
        t == T(3), U3, ...                         % в точке t1: значение u3 (скачок)
        t > T(3) & t < T2, U3 + (U4 - U3)*((t - T(3))/(T2 - T(3))), ... % от t1 до t2: линейно от u3 до u4
        t == T2, U4, ...                          % в точке T2: значение u4
        t > T2, 0 ...                          % от T2 до ∞: значение 0
    );    

    plot();
end